Tekla Open API Reference for Tekla Structures 2025
HatchAttributes.Name Property
 The name of the hatch. If an empty string is given as hatch name it will become "None".
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string Name { get; set; }
Public Property Name As String
	Get
	Set
Property Value
Type: String
See Also
Reference
HatchAttributes Class
Tekla.Structures.Drawing Namespace